# Terraform CI/CD

- [x] :paintbrush: Check if all Terraform configuration files are in a canonical format
- [x] :hammer_and_wrench: Validate the configuration files
- [x] :scroll: Generate a speculative execution plan

### Terraform Plan output
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.module.group_bots.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Organization bots, mainly for automation purpose."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "bots"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "sre-engineers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_devops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "devops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_ops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_secops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing security of the infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "secops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.user_xnbot.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xnbot"
    }

  # module.iam.module.user_xnbot.github_team_membership.team_memberships["bots"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xnbot"
    }

  # module.iam.module.user_xunleii.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xunleii"
    }

  # module.iam.module.user_xunleii.github_team_membership.team_memberships["sre-engineers"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xunleii"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warnings:

- Resource targeting is in effect
- Experimental feature "module_variable_optional_attrs" is active
  on iam/modules/group/version.tf line 15 (and 6 more)

To see the full warning notes, run Terraform without -compact-warnings.
Releasing state lock. This may take a few moments...

```

#
> _Report based on commit 463e5afd69ad773a57ae7e7b5c340d8375f1b693 (authored by **@xunleii**).  See [`actions#1042477699`](https://github.com/xnkube/be.xnku/actions/runs/1042477699) for more details._
<!-- Sticky Pull Request Comment -->